app/Controllers/Jurados.php

SELECT `tbl_coreografias`.`corgf_hashkey`
FROM `tbl_coreografias`
INNER JOIN `tbl_grupos` ON `tbl_grupos`.`grp_id` = `tbl_coreografias`.`grp_id`
WHERE `tbl_coreografias`.`corgf_ativo` = 1
ORDER BY `tbl_grupos`.`grp_titulo` ASC, `tbl_coreografias`.`corgf_id` ASC
 LIMIT 1
SELECT `tbl_grupos`.`grp_id`, `tbl_grupos`.`grp_titulo`, MIN(tbl_coreografias.corgf_id) AS first_corgf_id
FROM `tbl_coreografias`
INNER JOIN `tbl_grupos` ON `tbl_grupos`.`grp_id` = `tbl_coreografias`.`grp_id`
WHERE `tbl_coreografias`.`corgf_ativo` = 1
GROUP BY `tbl_grupos`.`grp_id`, `tbl_grupos`.`grp_titulo`
ORDER BY `tbl_grupos`.`grp_titulo` ASC
---
	public function index($corgf_hashkey = null)
	{
		// Se não foi passada uma coreografia específica, busca a primeira disponível
		if (!$corgf_hashkey) {
			// Buscar primeira coreografia ativa (simplificado para funcionar)
			$primeira_coreografia = $this->corgfMD
				->select('tbl_coreografias.corgf_hashkey')
				->join('tbl_grupos', 'tbl_grupos.grp_id = tbl_coreografias.grp_id', 'inner')
				->where('tbl_coreografias.corgf_ativo', 1)
				->orderBy('tbl_grupos.grp_titulo', 'ASC')
				->orderBy('tbl_coreografias.corgf_id', 'ASC')
				->first();
			if ($primeira_coreografia && !empty($primeira_coreografia->corgf_hashkey)) {
				return redirect()->to(site_url('jurados/index/' . $primeira_coreografia->corgf_hashkey));
			}
		}

		// Carregar dados da coreografia atual
		$this->data['coreografia_atual'] = null;
		$this->data['grupo_atual'] = null;
		$this->data['coreografias_grupo'] = [];
		$this->data['criterios'] = [];
		$this->data['avaliacoes_existentes'] = [];

        // Carregar lista de todos os grupos (simplificado)
		$this->data['grupos_lista'] = [];
		try {
			$gruposQuery = $this->corgfMD
				->select('tbl_grupos.grp_id, tbl_grupos.grp_titulo, MIN(tbl_coreografias.corgf_id) AS first_corgf_id')
				->join('tbl_grupos', 'tbl_grupos.grp_id = tbl_coreografias.grp_id', 'inner')
				->where('tbl_coreografias.corgf_ativo', 1)
				->groupBy('tbl_grupos.grp_id, tbl_grupos.grp_titulo')
				->orderBy('tbl_grupos.grp_titulo', 'ASC')
				->get();

SELECT `tbl_coreografias`.*, `tbl_grupos`.`grp_titulo`, `tbl_grupos`.`grp_id`, `tbl_modalidades`.`modl_titulo`, `tbl_formatos`.`formt_titulo`, `tbl_categorias`.`categ_titulo`
FROM `tbl_coreografias`
INNER JOIN `tbl_grupos` ON `tbl_grupos`.`grp_id` = `tbl_coreografias`.`grp_id`
LEFT JOIN `tbl_modalidades` ON `tbl_modalidades`.`modl_id` = `tbl_coreografias`.`modl_id`
LEFT JOIN `tbl_formatos` ON `tbl_formatos`.`formt_id` = `tbl_coreografias`.`formt_id`
LEFT JOIN `tbl_categorias` ON `tbl_categorias`.`categ_id` = `tbl_coreografias`.`categ_id`
WHERE `tbl_coreografias`.`corgf_hashkey` = '6f9e10989c6ccf2e88b23c5679b2fe5e'
 LIMIT 1
---

        if ($corgf_hashkey) {
			// BUSCAR COREOGRAFIA REAL DO BANCO DE DADOS
			$coreografia = $this->corgfMD->select('tbl_coreografias.*, tbl_grupos.grp_titulo, tbl_grupos.grp_id,
													tbl_modalidades.modl_titulo, tbl_formatos.formt_titulo,
													tbl_categorias.categ_titulo')
										->join('tbl_grupos', 'tbl_grupos.grp_id = tbl_coreografias.grp_id', 'inner')
										->join('tbl_modalidades', 'tbl_modalidades.modl_id = tbl_coreografias.modl_id', 'left')
										->join('tbl_formatos', 'tbl_formatos.formt_id = tbl_coreografias.formt_id', 'left')
										->join('tbl_categorias', 'tbl_categorias.categ_id = tbl_coreografias.categ_id', 'left')
										->where('tbl_coreografias.corgf_hashkey', $corgf_hashkey)
										->first();