app/Models/AvaliacoesModel.php

    public function get_avaliacoes_by_jurado_coreografia($jurd_id, $corgf_id)
    {
        // Detecta se a tabela é consolidada (sem crit_id) ou legado (com crit_id)
        try {
            $fields = array_map(fn($f) => $f->name, $this->db->getFieldData($this->table));
        } catch (\Throwable $e) {
            $fields = [];
        }

        $isConsolidated = !in_array('crit_id', $fields, true);

        if (!$isConsolidated) {
            // Legado: por critério
            $builder = $this->db->table($this->table . ' A');
            $builder->select('A.*, C.crit_titulo');
            $builder->join('tbl_criterios C', 'C.crit_id = A.crit_id', 'left');
            $builder->where('A.jurd_id', (int)$jurd_id);
            $builder->where('A.corgf_id', (int)$corgf_id);
            $builder->where('A.aval_ativo', 1);
            $builder->orderBy('C.crit_titulo', 'ASC');
            $query = $builder->get();
            return $query ? $query->getResult() : [];
        }

        // Consolidado: uma linha por jurado x coreografia. Converter para lista por critério.
        $row = $this->db->table($this->table)
            ->where('jurd_id', (int)$jurd_id)
            ->where('corgf_id', (int)$corgf_id)
            ->where('aval_ativo', 1)
            ->limit(1)
            ->get()
            ->getRow();
---
SELECT `A`.*, `C`.`crit_titulo`
FROM `tbl_avaliacoes` `A`
LEFT JOIN `tbl_criterios` `C` ON `C`.`crit_id` = `A`.`crit_id`
WHERE `A`.`jurd_id` = 1
AND `A`.`corgf_id` = 3
AND `A`.`aval_ativo` = 1
ORDER BY `C`.`crit_titulo` ASC
SELECT *
FROM `tbl_avaliacoes`
WHERE `jurd_id` = 1
AND `corgf_id` = 21
AND `aval_ativo` = 1
 LIMIT 1

    public function get_proxima_coreografia_nao_avaliada(int $jurd_id)
    {
        // Buscar todas as coreografias ativas, ordenadas por grupo e ID
        $builder = $this->db->table('tbl_coreografias C');
        $builder->select('C.corgf_id, C.corgf_hashkey, C.grp_id, G.grp_titulo');
        $builder->join('tbl_grupos G', 'G.grp_id = C.grp_id', 'inner');
        $builder->where('C.corgf_ativo', 1);
        $builder->orderBy('G.grp_titulo', 'ASC');
        $builder->orderBy('C.corgf_id', 'ASC');
        $coreografias = $builder->get()->getResult();

        if (empty($coreografias)) return null;

        // Para cada coreografia, verificar se já foi avaliada por este jurado
        foreach ($coreografias as $coreografia) {
            $ja_avaliada = $this->db->table('tbl_avaliacoes')
                ->where('jurd_id', $jurd_id)
                ->where('corgf_id', (int)$coreografia->corgf_id)
                ->where('aval_ativo', 1)
                ->where('nota_total_calculada IS NOT NULL')
                ->where('nota_total_calculada > 0')
                ->countAllResults() > 0;
---
SELECT `C`.`corgf_id`, `C`.`corgf_hashkey`, `C`.`grp_id`, `G`.`grp_titulo`
FROM `tbl_coreografias` `C`
INNER JOIN `tbl_grupos` `G` ON `G`.`grp_id` = `C`.`grp_id`
WHERE `C`.`corgf_ativo` = 1
ORDER BY `G`.`grp_titulo` ASC, `C`.`corgf_id` ASC
SELECT COUNT(*) AS `numrows`
FROM `tbl_avaliacoes`
WHERE `jurd_id` = 1
AND `corgf_id` = 2
AND `aval_ativo` = 1
AND `nota_total_calculada` IS NOT NULL
AND `nota_total_calculada` >0