app/Models/CoreografiasModel.php

	public function select_by_grp_id( $args = [] )
	{
		$insti_id = (int)(isset($args['insti_id']) ? $args['insti_id'] : '');
		$grp_id = (int)(isset($args['grp_id']) ? $args['grp_id'] : '');

		// DADOS TEMPORÁRIOS - SIMULANDO COREOGRAFIAS DO BANCO
		// Quando as tabelas reais forem criadas, descomente o código abaixo:
		/*
		$builder = $this->db->table( $this->table );
		$builder->from('tbl_coreografias CORF', true)
			->select('CORF.*')
			->select('MODL.modl_titulo')
			->select('FORMT.formt_titulo')
			->select('CATEG.categ_titulo')
			->join('tbl_modalidades MODL', 'MODL.modl_id = CORF.modl_id', 'LEFT')
			->join('tbl_formatos FORMT', 'FORMT.formt_id = CORF.formt_id', 'LEFT')
			->join('tbl_categorias CATEG', 'CATEG.categ_id = CORF.categ_id', 'LEFT')
			->where('CORF.insti_id', (int)$insti_id)
			->where('CORF.grp_id', (int)$grp_id)
			->orderBy('CORF.corgf_id', 'ASC')
			->limit(300);
		$query = $builder->get();
---
SELECT `CORF`.*, `MODL`.`modl_titulo`, `FORMT`.`formt_titulo`, `CATEG`.`categ_titulo`
FROM `tbl_coreografias` `CORF`
LEFT JOIN `tbl_modalidades` `MODL` ON `MODL`.`modl_id` = `CORF`.`modl_id`
LEFT JOIN `tbl_formatos` `FORMT` ON `FORMT`.`formt_id` = `CORF`.`formt_id`
LEFT JOIN `tbl_categorias` `CATEG` ON `CATEG`.`categ_id` = `CORF`.`categ_id`
WHERE `CORF`.`insti_id` = 1
AND `CORF`.`grp_id` = 9
ORDER BY `CORF`.`corgf_id` ASC
 LIMIT 300