app/Models/CriteriosModel.php

	public function select_all_by_insti_id( $insti_id = 0 )
	{
		// TENTAR BUSCAR DADOS REAIS DO BANCO PRIMEIRO
		try {
			$builder = $this->db->table( $this->table );
			$builder->where('insti_id', (int)$insti_id);
			$builder->where('crit_ativo', 1);
			$builder->orderBy('crit_titulo', 'ASC');
			$builder->limit(1000);
			$query = $builder->get();
---
SELECT *
FROM `tbl_criterios`
WHERE `insti_id` = 1
AND `crit_ativo` = 1
ORDER BY `crit_titulo` ASC
 LIMIT 1000