app/Models/ParticipantesModel.php

	public function select_by_func_grp_id( $args = [] )
	{
		$insti_id = (int)(isset($args['insti_id']) ? $args['insti_id'] : '');
		$func_id = (int)(isset($args['func_id']) ? $args['func_id'] : '');
		$grp_id = (int)(isset($args['grp_id']) ? $args['grp_id'] : '');

		$builder = $this->db->table( $this->table );
		$builder->select('partc_id, partc_nome, partc_documento, partc_file_foto');
		$builder->where('insti_id', (int)$insti_id);
		$builder->where('func_id', $func_id);
		$builder->where('grp_id', (int)$grp_id);
		$builder->orderBy('partc_nome', 'ASC');
		//$builder->limit(1);
		$query = $builder->get();
---
SELECT `partc_id`, `partc_nome`, `partc_documento`, `partc_file_foto`
FROM `tbl_participantes`
WHERE `insti_id` = 1
AND `func_id` = 3
AND `grp_id` = 9
ORDER BY `partc_nome` ASC